const { apiUrl: api, ukrainian} = ruavars

export function getCompareParamsHelper(infoType, successCb, errorCb) {
	return $.ajax({
		method: 'GET',
		url: `${api}/dictionary/statusapplication/${infoType}`
	}).success(successCb).fail(errorCb)
}

export const dictionary = {
	salary: {
		expect: ukrainian ? 'Очікування по зарплатні' : 'Ожидание по зарплате',
		lessThan: ukrainian ? 'Ці кандидати вказали рівень зарплатні нижче, ніж ви' : 'Эти кандидаты указали уровень зарплаты ниже, чем вы',
		equalTo: ukrainian ? 'Ці кандидати вказали такий самий рівень зарплатні' : 'Эти кандидаты указали такой же уровень зарплаты',
		moreThan: ukrainian ? 'Ці кандидати розраховують на більш високу зарплатню' : 'Эти кандидаты рассчитывают на более высокую зарплату'
	},
	experience: {
		expect: ukrainian ? 'Досвід роботи' : 'Опыт работы',
		lessThan: ukrainian ? 'У цих кандидатів вказано досвід роботи нижче, ніж увас' : 'У этих кандидатов указан опыт работы меньше, чем у вас',
		equalTo: ukrainian ? 'У цих кандидатів вказано такий самий досвід роботи' : 'У этих кандидатов указан такой же опыт работы',
		moreThan: ukrainian ? 'У цих кандидатів вказано більший досвід роботи' : 'У этих кандидатов указан больший опыт работы'
	},
	unsuff: {
		titleBold: ukrainian ? 'На жаль, недостатньо інформації для статистики.' : 'К сожалению, недостаточно информации для статистики.',
		title: ukrainian ? 'Ми надішлемо вам статистику на e-mail, як тільки більше кандидатів пройде опитування' : 'Мы пришлем вам статистику на e-mail, как только больше кандидатов пройдет опрос.',
		subTitle: ukrainian ? 'Порівняльна статистика по вакансії:' : 'Сравнительная статистика по вакансии:',
		salaryExpect: ukrainian ? 'Очікувана зарплатня' : 'Ожидаемая зарплата',
		experienceExpect: ukrainian ? 'Досвід роботи на аналогічній позиції' : 'Опыт работы на аналогичной позиции'
	},
	yetNotAvailable: {
		descr: ukrainian ? 'Порівняльна статистика поки не доступна. Пройдіть опитування, щоб отримати доступ до статистики.' : 'Сравнительная статистика пока не доступна. Пройдите опрос, чтобы получить доступ к статистике.',
		passSurvey: ukrainian ? 'Пройти опитування' : 'Пройти опрос'
	}
}

